#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/virtuosity/monday-demo/runs/run-Vk7XvyhbwRH6QKsX

Waiting for the plan to start...

Terraform v1.5.0
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # alicloud_cs_kubernetes_node_pool.managed_nodepool_ack_instance_1 will be created
  + resource "alicloud_cs_kubernetes_node_pool" "managed_nodepool_ack_instance_1" {
      + cluster_id                 = (known after apply)
      + deployment_set_id          = (known after apply)
      + desired_size               = 3
      + format_disk                = (known after apply)
      + id                         = (known after apply)
      + image_id                   = "aliyun_2_1903_x64_20G_alibase_20230308.vhd"
      + image_type                 = (known after apply)
      + install_cloud_monitor      = true
      + instance_charge_type       = "PostPaid"
      + instance_types             = [
          + "ecs.c6.xlarge",
        ]
      + internet_charge_type       = (known after apply)
      + internet_max_bandwidth_out = (known after apply)
      + keep_instance_name         = (known after apply)
      + name                       = "Managed_nodepool_ACK_instance_1"
      + node_count                 = (known after apply)
      + node_name_mode             = (known after apply)
      + password                   = (sensitive value)
      + platform                   = (known after apply)
      + resource_group_id          = (known after apply)
      + runtime_name               = "containerd"
      + runtime_version            = "1.6.20"
      + scaling_group_id           = (known after apply)
      + scaling_policy             = (known after apply)
      + security_group_id          = (known after apply)
      + security_group_ids         = (known after apply)
      + spot_strategy              = (known after apply)
      + system_disk_category       = "cloud_efficiency"
      + system_disk_size           = 40
      + unschedulable              = false
      + vpc_id                     = (known after apply)
      + vswitch_ids                = [
          + "vsw-8psjrm8g2zfrhlkhmy0sm",
        ]

      + management {
          + auto_repair     = true
          + auto_upgrade    = false
          + max_unavailable = 1
        }
    }

  # alicloud_cs_managed_kubernetes.ack_pro_cluster_instance_1 will be created
  + resource "alicloud_cs_managed_kubernetes" "ack_pro_cluster_instance_1" {
      + availability_zone            = (known after apply)
      + certificate_authority        = (known after apply)
      + cluster_domain               = "cluster.local"
      + cluster_spec                 = "ack.pro.small"
      + connections                  = (known after apply)
      + deletion_protection          = false
      + enable_rrsa                  = true
      + id                           = (known after apply)
      + install_cloud_monitor        = true
      + is_enterprise_security_group = (known after apply)
      + load_balancer_spec           = "slb.s1.small"
      + name                         = "ACK_Pro_cluster_instance_1"
      + name_prefix                  = "Terraform-Creation"
      + nat_gateway_id               = (known after apply)
      + new_nat_gateway              = true
      + node_cidr_mask               = 24
      + node_port_range              = (known after apply)
      + os_type                      = "Linux"
      + platform                     = (known after apply)
      + pod_cidr                     = "10.55.0.0/16"
      + pod_vswitch_ids              = [
          + "vsw-8psjrm8g2zfrhlkhmy0sm",
        ]
      + proxy_mode                   = "ipvs"
      + resource_group_id            = "rg-aek4rvnkip7bedq"
      + security_group_id            = (known after apply)
      + service_cidr                 = "172.16.0.0/16"
      + slb_id                       = (known after apply)
      + slb_internet                 = (known after apply)
      + slb_internet_enabled         = false
      + slb_intranet                 = (known after apply)
      + version                      = "1.24.6-aliyun.1"
      + vpc_id                       = (known after apply)
      + worker_auto_renew_period     = (known after apply)
      + worker_disk_size             = (known after apply)
      + worker_instance_charge_type  = (known after apply)
      + worker_nodes                 = (known after apply)
      + worker_period                = (known after apply)
      + worker_period_unit           = (known after apply)
      + worker_ram_role_name         = (known after apply)
      + worker_vswitch_ids           = [
          + "vsw-8psjrm8g2zfrhlkhmy0sm",
        ]

      + addons {
          + config   = jsonencode(
                {
                  + ENITrunking   = "false"
                  + IPVlan        = "true"
                  + NetworkPolicy = "true"
                }
            )
          + disabled = false
          + name     = "terway-eniip"
        }
      + addons {
          + disabled = false
          + name     = "csi-plugin"
        }
      + addons {
          + disabled = false
          + name     = "csi-provisioner"
        }
      + addons {
          + config   = jsonencode(
                {
                  + IngressDashboardEnabled = "true"
                }
            )
          + disabled = false
          + name     = "logtail-ds"
        }
      + addons {
          + config   = jsonencode(
                {
                  + sls_project_name = ""
                }
            )
          + disabled = false
          + name     = "ack-node-problem-detector"
        }
      + addons {
          + config   = jsonencode(
                {
                  + IngressSlbNetworkType = "internet"
                  + IngressSlbSpec        = "slb.s2.small"
                }
            )
          + disabled = false
          + name     = "nginx-ingress-controller"
        }
      + addons {
          + disabled = false
          + name     = "ack-node-local-dns"
        }
      + addons {
          + disabled = false
          + name     = "arms-prometheus"
        }
    }

  # alicloud_db_instance.rds_ha_instance_1 will be created
  + resource "alicloud_db_instance" "rds_ha_instance_1" {
      + acl                        = (known after apply)
      + auto_upgrade_minor_version = (known after apply)
      + babelfish_port             = (known after apply)
      + ca_type                    = (known after apply)
      + category                   = "HighAvailability"
      + connection_string          = (known after apply)
      + connection_string_prefix   = (known after apply)
      + create_time                = (known after apply)
      + db_instance_storage_type   = "cloud_essd"
      + db_instance_type           = (known after apply)
      + db_is_ignore_case          = (known after apply)
      + db_time_zone               = (known after apply)
      + deletion_protection        = false
      + engine                     = "PostgreSQL"
      + engine_version             = "14.0"
      + force_restart              = false
      + ha_config                  = (known after apply)
      + id                         = (known after apply)
      + instance_charge_type       = "Postpaid"
      + instance_name              = "RDS_HA_Instance_1"
      + instance_storage           = 20
      + instance_type              = "pg.x2.medium.2c"
      + maintain_time              = (known after apply)
      + monitoring_period          = (known after apply)
      + port                       = (known after apply)
      + private_ip_address         = (known after apply)
      + replication_acl            = (known after apply)
      + resource_group_id          = (known after apply)
      + security_group_id          = (known after apply)
      + security_group_ids         = (known after apply)
      + security_ip_mode           = "normal"
      + security_ips               = [
          + "172.16.0.0/16",
        ]
      + server_cert                = (known after apply)
      + server_key                 = (known after apply)
      + sql_collector_config_value = 30
      + sql_collector_status       = (known after apply)
      + ssl_action                 = (known after apply)
      + ssl_connection_string      = (known after apply)
      + ssl_status                 = (known after apply)
      + status                     = (known after apply)
      + target_minor_version       = (known after apply)
      + tcp_connection_type        = (known after apply)
      + vpc_id                     = "vpc-8psaljegjue2xsaao7ycg"
      + vswitch_id                 = "vsw-8psjrm8g2zfrhlkhmy0sm"
      + zone_id                    = "ap-southeast-3a"
      + zone_id_slave_a            = "ap-southeast-3b"
      + zone_id_slave_b            = (known after apply)
    }

  # alicloud_instance.ecs_instance_1 will be created
  + resource "alicloud_instance" "ecs_instance_1" {
      + availability_zone                  = (known after apply)
      + cpu                                = (known after apply)
      + credit_specification               = (known after apply)
      + deletion_protection                = false
      + deployment_set_group_no            = (known after apply)
      + dry_run                            = false
      + host_name                          = (known after apply)
      + http_endpoint                      = (known after apply)
      + http_put_response_hop_limit        = (known after apply)
      + http_tokens                        = (known after apply)
      + id                                 = (known after apply)
      + image_id                           = "aliyun_3_x64_20G_alibase_20230424.vhd"
      + instance_charge_type               = "PostPaid"
      + instance_name                      = "ECS-Instance-1"
      + instance_type                      = "ecs.t5-lc2m1.nano"
      + internet_max_bandwidth_in          = (known after apply)
      + internet_max_bandwidth_out         = 0
      + ipv6_address_count                 = (known after apply)
      + ipv6_addresses                     = (known after apply)
      + key_name                           = (known after apply)
      + maintenance_action                 = (known after apply)
      + memory                             = (known after apply)
      + os_name                            = (known after apply)
      + os_type                            = (known after apply)
      + primary_ip_address                 = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + resource_group_id                  = "rg-aek4rvnkip7bedq"
      + role_name                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ips              = (known after apply)
      + security_groups                    = [
          + "sg-8psis5n91cq4i6zcqlb3",
        ]
      + spot_duration                      = (known after apply)
      + spot_strategy                      = (known after apply)
      + status                             = (known after apply)
      + stopped_mode                       = (known after apply)
      + subnet_id                          = (known after apply)
      + system_disk_category               = "cloud_efficiency"
      + system_disk_name                   = "ECS-Disk-1"
      + system_disk_performance_level      = (known after apply)
      + system_disk_size                   = 80
      + volume_tags                        = (known after apply)
      + vswitch_id                         = "vsw-8psjrm8g2zfrhlkhmy0sm"
    }

  # alicloud_kvstore_instance.redis_dual_instance_1 will be created
  + resource "alicloud_kvstore_instance" "redis_dual_instance_1" {
      + availability_zone           = (known after apply)
      + backup_period               = (known after apply)
      + backup_time                 = (known after apply)
      + bandwidth                   = (known after apply)
      + capacity                    = (known after apply)
      + config                      = (known after apply)
      + connection_domain           = (known after apply)
      + connection_string           = (known after apply)
      + coupon_no                   = "youhuiquan_promotion_option_id_for_blank"
      + db_instance_name            = "Redis-Dual-Instance-1"
      + enable_backup_log           = 0
      + enable_public               = (known after apply)
      + encryption_key              = (known after apply)
      + encryption_name             = (known after apply)
      + end_time                    = (known after apply)
      + engine_version              = "5.0"
      + force_upgrade               = true
      + id                          = (known after apply)
      + instance_charge_type        = (known after apply)
      + instance_class              = "redis.master.small.default"
      + instance_name               = (known after apply)
      + instance_release_protection = (known after apply)
      + instance_type               = "Redis"
      + maintain_end_time           = (known after apply)
      + maintain_start_time         = (known after apply)
      + modify_mode                 = 0
      + node_type                   = (known after apply)
      + order_type                  = "UPGRADE"
      + payment_type                = "PostPaid"
      + private_connection_port     = (known after apply)
      + private_ip                  = (known after apply)
      + qps                         = (known after apply)
      + resource_group_id           = "rg-aek4rvnkip7bedq"
      + secondary_zone_id           = "ap-southeast-3b"
      + security_ip_group_name      = (known after apply)
      + security_ips                = [
          + "172.16.0.0/16",
        ]
      + status                      = (known after apply)
      + tde_status                  = (known after apply)
      + vpc_auth_mode               = "Open"
      + vswitch_id                  = "vsw-8psjrm8g2zfrhlkhmy0sm"
      + zone_id                     = "ap-southeast-3a"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ack_pro_cluster_instance_1_id = (known after apply)
  + ecs_instance_1_id             = (known after apply)
  + rds_ha_instance_1_id          = (known after apply)
  + redis_dual_instance_1_id      = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0

```
</details>
*Pushed by: @aaronkvirts, Action: `pull_request`*